#1 Having `imported_config` set during cluster creation:

When I create the cluster with:

```
resource "rancher2_cluster" "aks_imported" {
  name        = var.aks_cluster_name
  description = "Imported AKS cluster via Terraform"
  aks_config_v2 {
    cloud_credential_id = rancher2_cloud_credential.aks.id
    resource_group      = var.resource_group_name
    resource_location   = var.azure_location
    imported            = true
  }
  imported_config {}
}
```

this is the plan:
```

# rancher2_cluster.aks_imported will be created
  + resource "rancher2_cluster" "aks_imported" {
      + annotations                                                = (known after apply)
      + ca_cert                                                    = (sensitive value)
      + cluster_registration_token                                 = (known after apply)
      + default_pod_security_admission_configuration_template_name = (known after apply)
      + default_project_id                                         = (known after apply)
      + description                                                = "Imported AKS cluster via Terraform"
      + desired_agent_image                                        = (known after apply)
      + desired_auth_image                                         = (known after apply)
      + docker_root_dir                                            = (known after apply)
      + driver                                                     = (known after apply)
      + enable_cluster_istio                                       = (known after apply)
      + enable_network_policy                                      = (known after apply)
      + fleet_workspace_name                                       = (known after apply)
      + id                                                         = (known after apply)
      + istio_enabled                                              = (known after apply)
      + kube_config                                                = (sensitive value)
      + labels                                                     = (known after apply)
      + name                                                       = "pse-aeltai-aks"
      + system_project_id                                          = (known after apply)
      + windows_prefered_cluster                                   = false

      + aks_config_v2 {
          + cloud_credential_id            = "cattle-global-data:cc-hxt2s"
          + http_application_routing       = (known after apply)
          + imported                       = true
          + linux_admin_username           = (known after apply)
          + linux_ssh_public_key           = (known after apply)
          + load_balancer_sku              = (known after apply)
          + log_analytics_workspace_group  = (known after apply)
          + log_analytics_workspace_name   = (known after apply)
          + monitoring                     = (known after apply)
          + name                           = (known after apply)
          + network_dns_service_ip         = (known after apply)
          + network_docker_bridge_cidr     = (known after apply)
          + network_pod_cidr               = (known after apply)
          + network_policy                 = (known after apply)
          + network_service_cidr           = (known after apply)
          + node_resource_group            = (known after apply)
          + outbound_type                  = "loadBalancer"
          + private_cluster                = (known after apply)
          + resource_group                 = "pse-aeltai-aks-rg"
          + resource_location              = "westeurope"
          + subnet                         = (known after apply)
          + tags                           = (known after apply)
          + virtual_network                = (known after apply)
          + virtual_network_resource_group = (known after apply)
        }

      + imported_config {
          + private_registry_url = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
Results in the cluster-yaml having the imported_config section:
<img width="328" height="79" alt="Image" src="https://github.com/user-attachments/assets/ae5f9531-c72c-426f-8ce7-b9d683d67866" />

when i know add:

```
  imported_config {
      private_registry_url = "registry.suse.com"
  }
```

Plan runs successfully, but the private_registry_url is missing:   
```
importedConfig:
    kubeConfig: ''
```

#2 Having `imported_config` and `private_registry_url`="" set during cluster creation:

Terraform:
```
resource "rancher2_cluster" "aks_imported" {
  name        = var.aks_cluster_name
  description = "Imported AKS cluster via Terraform"
  aks_config_v2 {
    cloud_credential_id = rancher2_cloud_credential.aks.id
    resource_group      = var.resource_group_name
    resource_location   = var.azure_location
    imported            = true
  }
  imported_config {
      private_registry_url = ""
  }
}
```

results in a cluster-yaml without the private_registry_url value as-well:

```
  importedConfig:
    kubeConfig: ''
```

now if i add: 

```
  imported_config {
      private_registry_url = "registry.suse.com"
  }
```
Run the Plan, the resulting cluster-yaml still does not have it set.



---



So either way how the cluster was initialized, patching this spec via terraform does not change the cluster-yaml.
I hope this answers your question :) 


